Tekla Open API Reference for Tekla Structures 2025
HatchAttributes Properties
The HatchAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle in which to draw the hatch.
BackgroundColor
 The background color of the hatch.
Color
 The color of the hatch.
DrawBackgroundColor
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
FactorType
 The type of the hatch factor.
Name
 The name of the hatch. If an empty string is given as hatch name it will become "None".
ScaleX
 The scale value of the hatch in the X-direction.
ScaleY
 The scale value of the hatch in the Y-direction.
TrueBackgroundColor
 The true color (rgb enabled) of the hatch background.
TrueColor
 The true color (RGB enabled) of the hatch.
Top
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace